#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
proxmox_lxc.cloudflare-tunnel-solufit-2: Refreshing state... [id=milky-carina/lxc/2004]
proxmox_lxc.k3s-lb-3: Refreshing state... [id=milky-polaris/lxc/12003]
proxmox_lxc.k3s-lb-2: Refreshing state... [id=milky-carina/lxc/12002]
proxmox_vm_qemu.k8s-play-manager-ansible-host: Refreshing state... [id=milky-carina/qemu/30000]
proxmox_vm_qemu.k3s-manager-ansible-host: Refreshing state... [id=milky-carina/qemu/1000]
proxmox_vm_qemu.k3s-manager-controller-2: Refreshing state... [id=milky-carina/qemu/10001]
proxmox_vm_qemu.k3s-manager-controller-1: Refreshing state... [id=milky-carina/qemu/10000]
proxmox_vm_qemu.cloudflare-tunnel-solufit-4: Refreshing state... [id=milky-polaris/qemu/2006]
proxmox_vm_qemu.k3s-manager-controller-3: Refreshing state... [id=milky-polaris/qemu/10002]
proxmox_vm_qemu.k8s-play-controller: Refreshing state... [id=milky-polaris/qemu/31000]
proxmox_lxc.cloudflare-tunnel-solufit-3: Refreshing state... [id=milky-polaris/lxc/2007]
proxmox_vm_qemu.k3s-manager-worker-3: Refreshing state... [id=milky-carina/qemu/11002]
proxmox_vm_qemu.k3s-manager-worker-1: Refreshing state... [id=milky-carina/qemu/11000]
proxmox_vm_qemu.k3s-manager-worker-2: Refreshing state... [id=milky-polaris/qemu/11001]
proxmox_vm_qemu.k3s-nfs: Refreshing state... [id=milky-polaris/qemu/12004]
proxmox_vm_qemu.k8s-play-worker: Refreshing state... [id=milky-polaris/qemu/32000]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # proxmox_lxc.cloudflare-tunnel-solufit-2 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/2004"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.cloudflare-tunnel-solufit-3 will be updated in-place
  ~ resource "proxmox_lxc" "cloudflare-tunnel-solufit-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/2007"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-2 will be updated in-place
  ~ resource "proxmox_lxc" "k3s-lb-2" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-carina/lxc/12002"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_lxc.k3s-lb-3 will be updated in-place
  ~ resource "proxmox_lxc" "k3s-lb-3" {
      ~ description          = <<-EOT
            cloudflare tunnel for Solufit
        EOT
        id                   = "milky-polaris/lxc/12003"
        tags                 = null
      ~ unprivileged         = true -> false
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.cloudflare-tunnel-solufit-4 will be updated in-place
  ~ resource "proxmox_vm_qemu" "cloudflare-tunnel-solufit-4" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/2006"
        name                   = "solufit-cloudflare-tunnel-4"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (67 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-ansible-host" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/1000"
        name                   = "k3s-ansible-host"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (49 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "local-lvm" -> "main-storage"
                    }
                }
            }

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-1" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/10000"
        name                   = "solufit-k3s-controller-1"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "local-lvm" -> "main-storage"
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-2" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/10001"
        name                   = "solufit-k3s-controller-2"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "local-lvm" -> "main-storage"
                    }
                }
            }

            # (1 unchanged block hidden)
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-controller-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-controller-3" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/10002"
        name                   = "solufit-k3s-controller-3"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "local-lvm" -> "main-storage"
                    }
                }
            }
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                        id                   = 0
                      ~ storage              = "data" -> "main-storage"
                        # (23 unchanged attributes hidden)
                    }
                }
            }
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-1 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-1" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/11000"
        name                   = "solufit-k3s-worker-1"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "local-lvm" -> "main-storage"
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-2 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-2" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/11001"
        name                   = "solufit-k3s-worker-2"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "local-lvm" -> "main-storage"
                    }
                }
            }
          ~ scsi {
              ~ scsi0 {
                  ~ disk {
                        id                   = 0
                      ~ storage              = "data" -> "main-storage"
                        # (23 unchanged attributes hidden)
                    }
                }
            }
          + virtio {
            }
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-manager-worker-3 will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-manager-worker-3" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/11002"
        name                   = "solufit-k3s-worker-3"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      ~ disks {
          ~ ide {
              ~ ide0 {
                  ~ cloudinit {
                      ~ storage = "local-lvm" -> "main-storage"
                    }
                }
            }

            # (1 unchanged block hidden)
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

        # (3 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k3s-nfs will be updated in-place
  ~ resource "proxmox_vm_qemu" "k3s-nfs" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/12004"
        name                   = "solufit-k3s-nfs"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

      - serial {
          - id   = 0 -> null
          - type = "socket" -> null
        }

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-a-ansible-host will be created
  + resource "proxmox_vm_qemu" "k8s-a-ansible-host" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 2
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Kubernetes A Cluster Management Host"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.0.10.50/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 2048
      + name                   = "k8s-a-ansible-host"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.0.10.50"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_private_key        = (sensitive value)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-carina"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 40000

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "main-storage"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "16G"
                      + storage              = "main-storage"
                    }
                }
            }
        }

      + network {
          + bridge    = "k8sa"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = true
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k8s-a-controller-1 will be created
  + resource "proxmox_vm_qemu" "k8s-a-controller-1" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Kubernetes A Cluster Controller Node"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.0.10.51/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "k8s-a-controller-1"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.0.10.51"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-carina"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 40100

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "main-storage"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "main-storage"
                    }
                }
            }
        }

      + network {
          + bridge    = "k8sa"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k8s-a-worker-1 will be created
  + resource "proxmox_vm_qemu" "k8s-a-worker-1" {
      + additional_wait        = 5
      + agent                  = 1
      + automatic_reboot       = true
      + balloon                = 0
      + bios                   = "seabios"
      + boot                   = "order=scsi0"
      + bootdisk               = "scsi0"
      + ciupgrade              = false
      + clone                  = "ubuntu2204-withdocker"
      + clone_wait             = 10
      + cores                  = 4
      + cpu_type               = "host"
      + default_ipv4_address   = (known after apply)
      + default_ipv6_address   = (known after apply)
      + define_connection_info = true
      + desc                   = "Kubernetes A Cluster Worker Node"
      + force_create           = false
      + full_clone             = true
      + hotplug                = "network,disk,usb"
      + id                     = (known after apply)
      + ipconfig0              = "ip=10.0.10.61/24"
      + ipconfig1              = "ip=dhcp"
      + kvm                    = true
      + linked_vmid            = (known after apply)
      + memory                 = 8192
      + name                   = "k8s-a-worker-1"
      + onboot                 = false
      + os_type                = "cloud-init"
      + pool                   = "solufit"
      + protection             = false
      + reboot_required        = (known after apply)
      + scsihw                 = "virtio-scsi-pci"
      + skip_ipv4              = false
      + skip_ipv6              = false
      + sockets                = 1
      + ssh_forward_ip         = "10.0.10.61"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
      + ssh_user               = "ubuntu"
      + sshkeys                = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDHnxwb9bBqio0ljUF/PrZJ6rejcBZFegnKndwRz85p9YuijN0tI3vslgTDY9eek26WXc1CMECaSvMoMpV3CalrIELV2RoTfXZOCtxkaoJxZcBpBIWAoM77h5cVusZT0znx7a9wSW4rmqFXaEHc2BMkWNDnV1w6ykpycyTUECEOq/xYqCtgUwrfGR1/cb3XTpAPZVbaEoZPXU9JfH6TR+9uKoZF7tovmXmMUkpjUn/prVUEPYBMaMKAFedtBWL7kexdStDxArTgfOj3QG+e1DOZ1IAkmxeBKg3hkQ56ECAz25NtS0DJqAEVP4EqPmTYerlsEN1Ousiw6AVz6Pzpo4OIYrCzg83DZ4eKbMr1w7cM9d3YclRIqqDOHtGgOf55mITBCz3kgHO6Id6kU62XyEcA9rcQdixOZMMMvzCBKWCaUord0A0OjabtXPQ6BeG1LBdp2oCWd0dPhehrKUHjRVuH5DfXtUf/UkOP4ElnU70c0YkxWZTs8hC+7BybkOcGePk= yuuta@yuuta-ThinkPadE14
            
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQC6ahvrz1GH0KxZhCVNwxWB1WJTOGBccLXDCIECzzC2mG4anVCjeZ5kyHCSvO2smASACUOouthlXq7xDXFETE/coKVe0fSnU6ApTjMW9q4U9Bsjvcx2G4YENxbgJAaIYiA8Dw3Zw2fBQUIkhxOhXgwREK0xl98n880uzIZ3PFOUu+NvNu8SoJOiVq8vgdft2EWajADS9L1DRh8OR0CnQo/RsNdL6O4RnbPGJCHPMutLKbdsazMBzPjZ4DgqF88+rC5DaAEXPlAZ1mHriZDEOlYQoOFTSwKcaYfjJvONY9zSWYgdEY5lsrMpJWD3u9FuvyiWaNPClArcWOd4zvE1z+WWDPEfVSt+pe6eMubf9nZ1/RPsP8mugX2jOaMFdMjWN4gMk+d4i/9QbRQynlOhVWo1LwmE04QIJRw6k4TNcs6The5fdwLXvx9QWI7CwOpUxvc6CxaN109yZBc8Se0GdX4djPs97H4wYSdBX6pWoastC5ludVYXlE13zSOE76BAnes= yuuta@yuuta-ThinkPadE14
        EOT
      + tablet                 = true
      + tags                   = (known after apply)
      + target_node            = "milky-polaris"
      + unused_disk            = (known after apply)
      + vcpus                  = 0
      + vm_state               = "running"
      + vmid                   = 40200

      + disks {
          + ide {
              + ide0 {
                  + cloudinit {
                      + storage = "main-storage"
                    }
                }
            }
          + scsi {
              + scsi0 {
                  + disk {
                      + backup               = true
                      + format               = "raw"
                      + id                   = (known after apply)
                      + iops_r_burst         = 0
                      + iops_r_burst_length  = 0
                      + iops_r_concurrent    = 0
                      + iops_wr_burst        = 0
                      + iops_wr_burst_length = 0
                      + iops_wr_concurrent   = 0
                      + linked_disk_id       = (known after apply)
                      + mbps_r_burst         = 0
                      + mbps_r_concurrent    = 0
                      + mbps_wr_burst        = 0
                      + mbps_wr_concurrent   = 0
                      + size                 = "32G"
                      + storage              = "main-storage"
                    }
                }
            }
        }

      + network {
          + bridge    = "k8sa"
          + firewall  = false
          + id        = 0
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
          + mtu       = 1400
        }
      + network {
          + bridge    = "vmbr2"
          + firewall  = false
          + id        = 1
          + link_down = false
          + macaddr   = (known after apply)
          + model     = "virtio"
        }

      + serial {
          + id   = 0
          + type = "socket"
        }

      + smbios (known after apply)
    }

  # proxmox_vm_qemu.k8s-play-controller will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-controller" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/31000"
        name                   = "solufit-k8s-playground-controller"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-manager-ansible-host will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-manager-ansible-host" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-carina/qemu/30000"
        name                   = "k8s-play-ansible-host"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (49 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # proxmox_vm_qemu.k8s-play-worker will be updated in-place
  ~ resource "proxmox_vm_qemu" "k8s-play-worker" {
      + bootdisk               = "scsi0"
      + default_ipv4_address   = (known after apply)
        id                     = "milky-polaris/qemu/32000"
        name                   = "solufit-k8s-playground-worker"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (48 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 16 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pushed by: @Walkmana-25, Action: `pull_request`*